tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/hotRoom/0/p_rgh
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    ceiling
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    fixedWalls
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
}

// ************************************************************************* //
